; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=237, out_folder=./training, instance_id=39, seed=2063, goal_proportion=0.03

(define (problem blocksworld-39)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 - object)
 (:init 
    (arm-empty)
    (clear b195)
    (on b195 b114)
    (on b114 b49)
    (on b49 b137)
    (on b137 b152)
    (on b152 b113)
    (on-table b113)
    (clear b44)
    (on-table b44)
    (clear b4)
    (on b4 b235)
    (on b235 b10)
    (on b10 b130)
    (on-table b130)
    (clear b120)
    (on-table b120)
    (clear b116)
    (on b116 b58)
    (on-table b58)
    (clear b90)
    (on b90 b123)
    (on b123 b232)
    (on-table b232)
    (clear b141)
    (on b141 b118)
    (on b118 b108)
    (on b108 b134)
    (on b134 b184)
    (on b184 b14)
    (on b14 b189)
    (on b189 b2)
    (on b2 b186)
    (on b186 b109)
    (on b109 b217)
    (on b217 b212)
    (on b212 b12)
    (on-table b12)
    (clear b111)
    (on b111 b169)
    (on-table b169)
    (clear b78)
    (on b78 b234)
    (on b234 b182)
    (on-table b182)
    (clear b171)
    (on-table b171)
    (clear b185)
    (on b185 b5)
    (on-table b5)
    (clear b205)
    (on b205 b128)
    (on b128 b87)
    (on-table b87)
    (clear b81)
    (on b81 b62)
    (on-table b62)
    (clear b198)
    (on b198 b91)
    (on b91 b51)
    (on b51 b6)
    (on b6 b180)
    (on-table b180)
    (clear b219)
    (on b219 b204)
    (on-table b204)
    (clear b23)
    (on b23 b22)
    (on-table b22)
    (clear b170)
    (on b170 b70)
    (on b70 b30)
    (on b30 b16)
    (on b16 b179)
    (on b179 b200)
    (on b200 b162)
    (on-table b162)
    (clear b97)
    (on b97 b138)
    (on-table b138)
    (clear b220)
    (on b220 b226)
    (on b226 b165)
    (on b165 b133)
    (on b133 b218)
    (on b218 b117)
    (on b117 b155)
    (on b155 b131)
    (on b131 b178)
    (on b178 b164)
    (on b164 b60)
    (on b60 b167)
    (on b167 b153)
    (on b153 b112)
    (on b112 b135)
    (on-table b135)
    (clear b215)
    (on-table b215)
    (clear b57)
    (on b57 b75)
    (on b75 b160)
    (on b160 b53)
    (on b53 b190)
    (on b190 b93)
    (on b93 b50)
    (on b50 b86)
    (on b86 b15)
    (on-table b15)
    (clear b31)
    (on b31 b88)
    (on b88 b151)
    (on b151 b9)
    (on-table b9)
    (clear b72)
    (on b72 b76)
    (on b76 b106)
    (on b106 b126)
    (on b126 b140)
    (on b140 b202)
    (on-table b202)
    (clear b11)
    (on b11 b94)
    (on b94 b24)
    (on-table b24)
    (clear b65)
    (on b65 b29)
    (on b29 b66)
    (on b66 b21)
    (on b21 b236)
    (on b236 b206)
    (on b206 b33)
    (on b33 b61)
    (on b61 b222)
    (on-table b222)
    (clear b201)
    (on b201 b82)
    (on b82 b173)
    (on-table b173)
    (clear b129)
    (on b129 b85)
    (on b85 b13)
    (on b13 b224)
    (on-table b224)
    (clear b36)
    (on b36 b208)
    (on b208 b40)
    (on b40 b199)
    (on b199 b80)
    (on-table b80)
    (clear b136)
    (on b136 b194)
    (on-table b194)
    (clear b223)
    (on b223 b188)
    (on b188 b45)
    (on b45 b158)
    (on b158 b107)
    (on b107 b67)
    (on-table b67)
    (clear b146)
    (on b146 b35)
    (on b35 b156)
    (on b156 b150)
    (on-table b150)
    (clear b104)
    (on-table b104)
    (clear b19)
    (on b19 b168)
    (on b168 b48)
    (on-table b48)
    (clear b34)
    (on-table b34)
    (clear b74)
    (on b74 b43)
    (on b43 b207)
    (on b207 b54)
    (on b54 b181)
    (on b181 b38)
    (on b38 b161)
    (on b161 b147)
    (on-table b147)
    (clear b144)
    (on-table b144)
    (clear b1)
    (on b1 b197)
    (on b197 b32)
    (on-table b32)
    (clear b73)
    (on b73 b26)
    (on b26 b145)
    (on-table b145)
    (clear b8)
    (on b8 b98)
    (on b98 b95)
    (on b95 b3)
    (on b3 b143)
    (on-table b143)
    (clear b221)
    (on b221 b122)
    (on-table b122)
    (clear b99)
    (on b99 b213)
    (on b213 b191)
    (on b191 b139)
    (on b139 b157)
    (on-table b157)
    (clear b71)
    (on b71 b42)
    (on b42 b27)
    (on-table b27)
    (clear b47)
    (on b47 b25)
    (on b25 b159)
    (on b159 b110)
    (on-table b110)
    (clear b69)
    (on b69 b102)
    (on-table b102)
    (clear b203)
    (on b203 b41)
    (on-table b41)
    (clear b225)
    (on b225 b166)
    (on b166 b63)
    (on b63 b177)
    (on b177 b103)
    (on b103 b229)
    (on b229 b228)
    (on b228 b77)
    (on-table b77)
    (clear b127)
    (on b127 b231)
    (on b231 b119)
    (on-table b119)
    (clear b68)
    (on-table b68)
    (clear b210)
    (on-table b210)
    (clear b148)
    (on b148 b175)
    (on b175 b52)
    (on b52 b7)
    (on b7 b89)
    (on-table b89)
    (clear b187)
    (on b187 b193)
    (on b193 b124)
    (on-table b124)
    (clear b101)
    (on b101 b56)
    (on b56 b149)
    (on-table b149)
    (clear b142)
    (on b142 b92)
    (on b92 b18)
    (on-table b18)
    (clear b100)
    (on b100 b209)
    (on-table b209)
    (clear b192)
    (on b192 b163)
    (on b163 b211)
    (on-table b211)
    (clear b154)
    (on b154 b84)
    (on b84 b105)
    (on b105 b121)
    (on b121 b227)
    (on b227 b176)
    (on-table b176)
    (clear b20)
    (on-table b20)
    (clear b79)
    (on-table b79)
    (clear b172)
    (on b172 b115)
    (on b115 b230)
    (on-table b230)
    (clear b183)
    (on b183 b64)
    (on b64 b37)
    (on b37 b237)
    (on b237 b174)
    (on b174 b83)
    (on b83 b125)
    (on b125 b55)
    (on b55 b17)
    (on b17 b59)
    (on b59 b28)
    (on-table b28)
    (clear b233)
    (on b233 b196)
    (on b196 b96)
    (on b96 b216)
    (on b216 b132)
    (on b132 b46)
    (on-table b46)
    (clear b39)
    (on-table b39)
    (clear b214)
    (on-table b214))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b1)
    (on b1 b7)
    (on b7 b5)
    (on b5 b2)
    (on-table b2)
    (clear b3)
    (on b3 b6)
    (on-table b6))))

; plan
1. (unstack b4 b235)
   deleted: (on b4 b235) (clear b4) (arm-empty)
   added: (holding b4) (clear b235)
   goals met: 1 of 10
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 10
3. (unstack b141 b118)
   deleted: (on b141 b118) (clear b141) (arm-empty)
   added: (holding b141) (clear b118)
   goals met: 3 of 10
4. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 3 of 10
5. (unstack b118 b108)
   deleted: (on b118 b108) (clear b118) (arm-empty)
   added: (holding b118) (clear b108)
   goals met: 3 of 10
6. (putdown b118)
   deleted: (holding b118)
   added: (clear b118) (arm-empty) (on-table b118)
   goals met: 3 of 10
7. (unstack b108 b134)
   deleted: (on b108 b134) (clear b108) (arm-empty)
   added: (holding b108) (clear b134)
   goals met: 3 of 10
8. (putdown b108)
   deleted: (holding b108)
   added: (clear b108) (arm-empty) (on-table b108)
   goals met: 3 of 10
9. (unstack b134 b184)
   deleted: (on b134 b184) (clear b134) (arm-empty)
   added: (holding b134) (clear b184)
   goals met: 3 of 10
10. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 3 of 10
11. (unstack b148 b175)
   deleted: (on b148 b175) (clear b148) (arm-empty)
   added: (holding b148) (clear b175)
   goals met: 3 of 10
12. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 3 of 10
13. (unstack b175 b52)
   deleted: (on b175 b52) (clear b175) (arm-empty)
   added: (holding b175) (clear b52)
   goals met: 3 of 10
14. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 3 of 10
15. (unstack b184 b14)
   deleted: (on b184 b14) (clear b184) (arm-empty)
   added: (holding b184) (clear b14)
   goals met: 3 of 10
16. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 3 of 10
17. (unstack b14 b189)
   deleted: (on b14 b189) (clear b14) (arm-empty)
   added: (holding b14) (clear b189)
   goals met: 3 of 10
18. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 10
19. (unstack b185 b5)
   deleted: (on b185 b5) (clear b185) (arm-empty)
   added: (holding b185) (clear b5)
   goals met: 3 of 10
20. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 3 of 10
21. (unstack b189 b2)
   deleted: (on b189 b2) (clear b189) (arm-empty)
   added: (holding b189) (clear b2)
   goals met: 3 of 10
22. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 3 of 10
23. (unstack b2 b186)
   deleted: (on b2 b186) (clear b2) (arm-empty)
   added: (holding b2) (clear b186)
   goals met: 3 of 10
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 10
25. (unstack b198 b91)
   deleted: (on b198 b91) (clear b198) (arm-empty)
   added: (holding b198) (clear b91)
   goals met: 4 of 10
26. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 4 of 10
27. (unstack b52 b7)
   deleted: (on b52 b7) (clear b52) (arm-empty)
   added: (holding b52) (clear b7)
   goals met: 4 of 10
28. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 10
29. (unstack b8 b98)
   deleted: (on b8 b98) (clear b8) (arm-empty)
   added: (holding b8) (clear b98)
   goals met: 4 of 10
30. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 10
31. (unstack b91 b51)
   deleted: (on b91 b51) (clear b91) (arm-empty)
   added: (holding b91) (clear b51)
   goals met: 4 of 10
32. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 4 of 10
33. (unstack b51 b6)
   deleted: (on b51 b6) (clear b51) (arm-empty)
   added: (holding b51) (clear b6)
   goals met: 4 of 10
34. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 10
35. (unstack b6 b180)
   deleted: (on b6 b180) (clear b6) (arm-empty)
   added: (holding b6) (clear b180)
   goals met: 4 of 10
36. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 10
37. (unstack b98 b95)
   deleted: (on b98 b95) (clear b98) (arm-empty)
   added: (holding b98) (clear b95)
   goals met: 5 of 10
38. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 5 of 10
39. (unstack b95 b3)
   deleted: (on b95 b3) (clear b95) (arm-empty)
   added: (holding b95) (clear b3)
   goals met: 6 of 10
40. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 6 of 10
41. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 10
42. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 7 of 10
43. (unstack b7 b89)
   deleted: (on b7 b89) (clear b7) (arm-empty)
   added: (holding b7) (clear b89)
   goals met: 7 of 10
44. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 8 of 10
45. (unstack b1 b197)
   deleted: (on b1 b197) (clear b1) (arm-empty)
   added: (holding b1) (clear b197)
   goals met: 7 of 10
46. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 9 of 10
47. (unstack b3 b143)
   deleted: (on b3 b143) (clear b3) (arm-empty)
   added: (holding b3) (clear b143)
   goals met: 8 of 10
48. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 10 of 10
